GTD/testSlide.org
#+OPTIONS: num:nil toc:nil
#+REVEAL_TRANS: linear
#+REVEAL_THEME: jr0cket
#+OPTIONS: reveal_width:1200
#+OPTIONS: reveal_height:800
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+OPTIONS: reveal_center:nil 
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t 
#+Title: [slides by ox-reveal and reveal.js] 
#+Author: Ye Zhaoliang
#+Email: zhaoturkkey@163.com 



* I will grow.
* I will shrink.
* I rolled in.
** hellf
** dsdfsdf
** sdfsadg
*** dsfsd
*** dfsdf
*** gasd
*** sgsd
* I will fade out.
* I don't fragment.



#+ATTR_REVEAL: :frag ( highlight-blue )
    * I appear.
    * I appear.
    * I appear.

** appear procedurely      
#+ATTR_REVEAL: :frag ( roll-in )
- experiment with ideas quickly
- use branching to experiment in code  
- throw away code that is not wanted
- go back to the great idea you had right at the start


** Advance

#+BEGIN_NOTES
My notes
#+END_NOTES


很有意思的


#+BEGIN_SRC org
  ,#+BEGIN_NOTES

  演讲者模式
  使用s，进入演讲者模式，类似ppt

  ,#+END_NOTES
#+END_SRC


#+REVEAL: split
In interview with Magnar Sveen, he gives some good advice in learning Emacs:

1. Learn Emacs on its own. Don't try to "learn Emacs and Clojure" for instance. I would suggest learn new tools before you have to use it.
2. Grab a friend who already knows it. I would suggest that if you don't have that, at least learn it with a friend who is also learning it.
3. Everyone has their own way of learning something new, so whether you make flash cards, graphical notes, or whatever, use what you know works for you.
Unless Sacha Chua got you first, let me know if I can help.

* image
:PROPERTIES:
:reveal_background: ./spacemacs.jpg
:reveal_background_size: 800px
:reveal_background_trans: slide
:END:

* mathJax

${n! \over k!(n-k)!} = {n \choose k}$


