GTD/testSlide.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>[slides by ox-reveal and reveal.js]</title>
<meta name="author" content="(Ye Zhaoliang)"/>
<link rel="stylesheet" href="file:///k:/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="file:///k:/reveal.js/css/theme/jr0cket.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">[slides by ox-reveal and reveal.js]</h1><h2 class="author">Ye Zhaoliang</h2><p class="date">Created: 2018-05-04 周五 01:52</p>
</section>



<section>
<section id="slide-org11206c3">
<h2 id="org11206c3">I will grow.</h2>
</section>
</section>
<section>
<section id="slide-org4ef33ae">
<h2 id="org4ef33ae">I will shrink.</h2>
</section>
</section>
<section>
<section id="slide-org8816ca2">
<h2 id="org8816ca2">I rolled in.</h2>
<div class="outline-text-2" id="text-org8816ca2">
</div>
</section>
</section>
<section>
<section id="slide-org951b10f">
<h3 id="org951b10f">hellf</h3>
</section>
</section>
<section>
<section id="slide-org4189e00">
<h3 id="org4189e00">dsdfsdf</h3>
</section>
</section>
<section>
<section id="slide-org705e0ef">
<h3 id="org705e0ef">sdfsadg</h3>
<div class="outline-text-3" id="text-org705e0ef">
</div>
</section>
<section id="slide-orgf0e5e40">
<h4 id="orgf0e5e40">dsfsd</h4>
</section>
<section id="slide-org7474e48">
<h4 id="org7474e48">dfsdf</h4>
</section>
<section id="slide-org94d0c34">
<h4 id="org94d0c34">gasd</h4>
</section>
<section id="slide-orgceafd43">
<h4 id="orgceafd43">sgsd</h4>
</section>
</section>
<section>
<section id="slide-orgef18d44">
<h2 id="orgef18d44">I will fade out.</h2>
</section>
</section>
<section>
<section id="slide-org7c6b7c1">
<h2 id="org7c6b7c1">I don't fragment.</h2>
<ul>
<li class="fragment highlight-blue">I appear.</li>
<li class="fragment highlight-blue">I appear.</li>
<li class="fragment highlight-blue">I appear.</li>

</ul>

</section>
</section>
<section>
<section id="slide-org3ff3815">
<h3 id="org3ff3815">appear procedurely</h3>
<ul>
<li class="fragment roll-in">experiment with ideas quickly</li>
<li class="fragment roll-in">use branching to experiment in code</li>
<li class="fragment roll-in">throw away code that is not wanted</li>
<li class="fragment roll-in">go back to the great idea you had right at the start</li>

</ul>


</section>
</section>
<section>
<section id="slide-org9502777">
<h3 id="org9502777">Advance</h3>
<aside class="notes">
<p>
My notes
</p>

</aside>


<p>
很有意思的
</p>


<div class="org-src-container">

<pre  class="src src-org"><span style="color: #827591; background-color: #373040;">#+BEGIN_NOTES</span>

&#28436;&#35762;&#32773;&#27169;&#24335;
&#20351;&#29992;s&#65292;&#36827;&#20837;&#28436;&#35762;&#32773;&#27169;&#24335;&#65292;&#31867;&#20284;ppt

<span style="color: #827591; background-color: #373040;">#+END_NOTES</span>
</pre>
</div>


</section>
<section >
<p>
In interview with Magnar Sveen, he gives some good advice in learning Emacs:
</p>

<ol>
<li>Learn Emacs on its own. Don't try to "learn Emacs and Clojure" for instance. I would suggest learn new tools before you have to use it.</li>
<li>Grab a friend who already knows it. I would suggest that if you don't have that, at least learn it with a friend who is also learning it.</li>
<li>Everyone has their own way of learning something new, so whether you make flash cards, graphical notes, or whatever, use what you know works for you.</li>

</ol>
<p>
Unless Sacha Chua got you first, let me know if I can help.
</p>

</section>
</section>
<section>
<section id="slide-org466fea1" data-background="./spacemacs.jpg" data-background-size="800px" data-background-transition="slide">
<h2 id="org466fea1">image</h2>

</section>
</section>
<section>
<section id="slide-org80d5c62">
<h2 id="org80d5c62">mathJax</h2>
<p>
\({n! \over k!(n-k)!} = {n \choose k}\)
</p>
</section>
</section>
</div>
</div>
Ye Zhaoliang
<script src="file:///k:/reveal.js/lib/js/head.min.js"></script>
<script src="file:///k:/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: false,
slideNumber: 'c',
rollingLinks: true,
keyboard: true,
overview: true,
width: 1200,
height: 800,
margin: 0.10,
minScale: 0.50,
maxScale: 2.50,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'file:///k:/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'file:///k:/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///k:/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///k:/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'file:///k:/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
